 3 Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

# *Пример*

# - при [1, 1, 2, 3, 3, 4, 1, 5, 7, 8, 8, 7, 9]     ->        [2, 4, 5, 9]
def count(arr, n):
    
    mp = dict()

    for i in range(n):
        if arr[i] in mp.keys():
            mp[arr[i]] += 1
        else:
            mp[arr[i]] = 1

    for x in mp:
        if mp[x]==1 :
            print(x);

arr = [1, 1, 2, 3, 3, 4, 1, 5, 7, 8, 8, 7, 9]  
n = len(arr) 
count(arr, n)